{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Chong_Nonsi",
    "1": "National_Stadium",
    "2": "Ratchadamri",
    "3": "Saint_Louis",
    "4": "Sala_Daeng",
    "5": "Saphan_Taksin",
    "6": "Siam",
    "7": "Surasak"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Chong_Nonsi": 0,
    "National_Stadium": 1,
    "Ratchadamri": 2,
    "Saint_Louis": 3,
    "Sala_Daeng": 4,
    "Saphan_Taksin": 5,
    "Siam": 6,
    "Surasak": 7
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.0"
}
